window.PREFILLED_CATEGORIES = [
  {
    "id": "1-тестування",
    "name": "Тестування"
  },
  {
    "id": "2-види-тестування",
    "name": "Види тестування"
  },
  {
    "id": "3-документація-qa",
    "name": "Документація QA"
  },
  {
    "id": "4-тест-дизайн-техніки",
    "name": "Тест дизайн техніки"
  },
  {
    "id": "5-вимоги",
    "name": "Вимоги"
  },
  {
    "id": "6-qa-process",
    "name": "QA Process"
  },
  {
    "id": "7-ризики",
    "name": "Ризики"
  },
  {
    "id": "8-qa-estimaton",
    "name": "QA Estimaton"
  },
  {
    "id": "9-репорти",
    "name": "Репорти"
  },
  {
    "id": "10-api",
    "name": "API"
  },
  {
    "id": "11-git-і-gitlab",
    "name": "Git і Gitlab"
  },
  {
    "id": "12-chrome-developer-tools",
    "name": "Chrome Developer Tools"
  },
  {
    "id": "13-методології-розробки",
    "name": "Методології розробки"
  },
  {
    "id": "14-особливості-тестування-нативних-додатків",
    "name": "Особливості тестування нативних додатків."
  },
  {
    "id": "15-фази-тестування",
    "name": "Фази тестування"
  },
  {
    "id": "16-ситуїтивні-запитання",
    "name": "Ситуїтивні запитання"
  },
  {
    "id": "17-інструменти",
    "name": "Інструменти"
  },
  {
    "id": "18-англійська",
    "name": "Англійська"
  }
];

window.PREFILLED_QUESTIONS = [
  {
    "categoryId": "1-тестування",
    "question": "Шо таке тестування?",
    "answer": "Перевірка відповідності між реальною поведінкою програми та її очікуваною поведінкою на кінцевому наборі тестів, обраному певним чином.\n\nТестування -  це одна з технік контролю якості, що включає активності:\nTest Management (планування робіт)\nTest Design (проектування тестів)\nTest Execution (виконання тестів)\nTest Analysis (аналіз результатів тестування)\nЯкість - це сукупність характеристик програмного забезпечення, що належать до його здатності задовольняти встановлені вимоги та очікування користувачів."
  },
  {
    "categoryId": "1-тестування",
    "question": "Навіщо тестувати ПО?",
    "answer": "Виявлення дефектів\nПідвищення впевненості в рівні якості\nНадання інформації для прийняття рішень\nЗапобігання дефектів"
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Типи тестування.",
    "answer": "1. Функціональне тестування\nФункціональне тестування (Functional testing)\nТестування графічного інтерфейсу користувача (GUI Testing)\nТестування безпеки (Security and Access Control Testing)\nТестування взаємодії (Interoperability Testing)\n2. Нефункціональні тестування\nТестування навантаження\nТестування продуктивності\nСтрес тестування\nЮзабіліті тестування;\nТестування документації\nТестування встановлення\nТестування конфігурації\nЕксплорарі тестінг\nТестування локалізації, інтернаціоналізація\n3. Тестування змін:\nДимове тестування (Smoke Testing)\nРегресійне тестування (Regression Testing)\nПовторне тестування (Re-testing)\nТестування збірки (Build Verification Test)\nСанітарне тестування або перевірка узгодженості/справності (Sanity Testing)\n4. Класифікація по типам тестування:\nПо виконавцям тестування : Альфа і Бета і Гаммма тестування.\nПо рівню тестування : Модульне, Інтеграційне, Системне\nПо запуску коду : Статичне і Динамічне\nПо цілям : Функційне і Нефункційне\nПо степені автоматизації : Автоматизоване , Неавтоматизоване і Полуавтоматизоване\nПо позитивності сценарія : Позитивне і Негативне\nПо знаню системи : Чорний , Білий і Сірий ящик"
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Шо таке Regression и Confirmation тестування, різниця між ними?",
    "answer": "Регресійне тестування (Regression testing) – проводиться з метою перевірки працездатності функціоналу, що існує, та перевірки на відсутність сторонніх помилок Виконується тільки при додаванні нової фічі (додаткова функціональність ПЗ) або істотній зміні функціоналу системи.\nПовторне тестування (Retesting) – це процес перевірки програми після виправлення помилок, щоб побачити, чи були ці помилки дійсно виправлені і чи працює програма тепер правильно.\nДимове тестування (smoke test): Вибірка із загального числа запланованих тестових сценаріїв, що покриває основну функціональність компонента або системи. Проводиться з метою упевнитися, що базові функції програми в цілому працюють коректно, без заглиблення в деталі.\nСанітарне тестування (Sanity testing) направлено вглиб функції . Його проводять після : після виправлення помилок , після внесення невеликих змін , після оновлень функціоналу."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Рівні тестування.",
    "answer": "Модульне : Перівяреється модуль ( Поле логіна ), (Поле пароля)\nІнтеграції : Перевіряється як ці два модулі працюють друг з другом.\nСистемне : Тестування системи проводиться на повній, інтегрованій системі. Це дозволяє перевірити відповідність системи відповідно до вимог\nПриймання : перевіряє, чи відповідають вимогам специфікації або контракту відповідно до її поставки."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Тестування Конфігурації ,  Дослідницьке , Адгок , Взаємодії.",
    "answer": "Тестування Конфігурації : Спеціальний вид тестування, спрямований на перевірку роботи програмного забезпечення при різних конфігураціях системи (заявлених платформах, драйверах, що підтримуються, при різних конфігураціях комп'ютерів.\nТестування взаємодії -  це вид тестування програмного забезпечення, який перевіряє, як різні системи або компоненти можуть співпрацювати між собою. Головна мета полягає в тому, щоб переконатися, що різні частини програми (або навіть різні програми) можуть взаємодіяти правильно та ефективно під час обміну даними або командами.\nЕксплораторне (дослідницьке) тестування - це метод тестування програмного продукту, при якому тестер (або тестери) активно досліджують програму без попередньо встановлених планів чи сценаріїв тестування. Основна ідея полягає в тому, щоб випробувати програму \"на льоту\", спробувати різні комбінації вхідних даних і дій, шукати помилки та незвичайні поведінки.\nАд-гок тестування - це вид тестування програмного забезпечення, який виконується без заздалегідь підготовлених тестових сценаріїв чи плану. Воно полягає у тому, що тестер або розробник перевіряє програму, спробуючи відтворити різні ситуації, які можуть виникнути в реальних умовах використання програми."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Шо таке методи Чорного, Білого, Сірого ящика?",
    "answer": "Чорний -  нам зовсім невідома як система влаштована всередині\nСірий - нам частково відомо деталі системи яку ми тестуємо\nБілий - нам повність відомі деталі системи яку ми тестуємо"
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Тестування локалізації , приклади :",
    "answer": "Переклад текстів: Різні мови чи перекладено продукт\nФорматування дат і часу: Американська модель, Європейська\nЧислові формати: Наприклад, перевірка відображення числа 1,000.50 у США та 1 000,50 в Франції.\nВалюти: Перевірка коректності відображення валютних символів $100 у США та €100 в Європі.\nТестування місцевих налаштувань: Перевірка відображення правильних символів (кирилиця, китайські ієрогліфи тощо).\nПеревірка розміщення: Перевірка що нічого не виглядає обрізаним або зсунутим через межі."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Що таке позитивне і негативне тестування?",
    "answer": "Позитивне тестування – це тестування із застосуванням сценаріїв, які відповідають нормальній (штатній, очікуваній) поведінці системи. З його допомогою ми можемо визначити, що система робить саме те, для чого і була створена.\nНегативним - називають тестування, в рамках якого застосовуються сценарії, які відповідають позаштатній поведінці тестованої системи. Це можуть бути, наприклад, виняткові ситуації або невірні дані"
  },
  {
    "categoryId": "2-види-тестування",
    "question": "End-to-End (E2E) тестування",
    "answer": "End-to-End - це тип тестування, який перевіряє повний потік роботи системи від початку до кінця. Воно спрямоване на тестування всього процесу, починаючи з точки входу в систему і до кінцевого результату, включаючи всі взаємодії між компонентами і підсистемами.\nПриклад : Перевірка функціоналу Логіну.\nВідкриття сторінки логіну\nВведення облікових даних\nНатискання кнопки \"Логін\"\nРезультат : Успішне проходження цього сценарію означає, що система коректно обробляє дані."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Інтернаціоналізація , Локалізація різниця?",
    "answer": "Інтернаціоналізація — це підготовка програмного забезпечення для підтримки багатьох мов і культур. Це базовий етап, який полегшує подальшу локалізацію ( Ключі в продукті викоритовувати ).\nЛокалізація — це конкретна адаптація програмного забезпечення для певного ринку або аудиторії. Локалізація використовує можливості, створені на етапі інтернаціоналізації, щоб зробити продукт доступним для користувачів у різних регіонах."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Статичне та динамічне тестування",
    "answer": "Статичне (static) тестування - Здійснюється БЕЗ запуску коду програми.\nПриклади: тестування вимог/документації, код ревью, статичні аналізатори коду.\nДинамічне (dynamic) тестування - Здійснюється З запуском коду програми.\nПриклади: запустив програму і тестуєш."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Шо таке A/B тестування?",
    "answer": "A / B тест - це порівняння двох версій одного і того ж елемента веб-сторінки в двох варіантах дизайну. Ви демонструєте їх рівним половинкам своєї аудиторії. Грунтуючись на коефіцієнтах конверсії або інших показниках, ви можете вирішити, який з них найбільш ефективний."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Шо таке тестування навантаження, коли проводити, на якому етапі.",
    "answer": "Тестування продуктивності – це комплекс типів тестування, метою якого є визначення працездатності, стабільності, споживання ресурсів та інших атрибутів якості додатка в умовах різних сценаріїв використання та навантажень. Тестування продуктивності дозволяє знаходити можливі вразливості та недоліки в системі з метою запобігання їх негативному впливу на роботу програми в умовах використання. Необхідні параметри роботи системи в певному середовищі можна тестувати за допомогою:\nВизначення робочої кількості користувачів додатку.\nВимірювання часу виконання різних операцій системи.\nВизначення продуктивності додатка при різних рівнях навантаження.\nВизначення допустимих меж продуктивності програми при різних рівнях навантаження."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Що таке піраміда тестування?",
    "answer": "Піраміда тестування — це концепція, яка описує стратегію тестування програмного забезпечення, що передбачає різний рівень тестів на різних етапах розробки. Її можна порівняти з пірамідою, де широкі бази знаходяться внизу, а верхні рівні стають вужчими.\nОсновні принципи піраміди тестування виглядають так:\n1. Юніт-тести (Unit Tests) – нижній рівень:\nЩо це: Тести, які перевіряють окремі компоненти або функції програми (наприклад, методи в класах). Вони мають бути швидкими, ізольованими та зосередженими на перевірці логіки коду.\nОсобливості: Вони складають більшість тестів і виконуються дуже часто. Оскільки юніт-тести зазвичай не залежать від зовнішніх систем (наприклад, баз даних або API), вони виконуються швидко.\nКількість: Тестів повинно бути багато, адже вони покривають деталі реалізації.\n2. Інтеграційні тести (Integration Tests) – середній рівень:\nЩо це: Тести, що перевіряють, як різні компоненти програми взаємодіють між собою. Вони фокусуються на інтеграції кількох модулів або сервісів, щоб впевнитись, що вони правильно працюють разом.\nОсобливості: Ці тести можуть бути повільнішими, оскільки вони зазвичай залежать від зовнішніх ресурсів, таких як бази даних або API.\nКількість: Інтеграційних тестів має бути менше, ніж юніт-тестів, оскільки вони покривають більші блоки коду.\n3. Тести інтерфейсу користувача (UI Tests) – верхній рівень:\nЩо це: Тести, що перевіряють поведінку програми на рівні інтерфейсу користувача. Це тести, які взаємодіють з інтерфейсом так, як це робить користувач (натискання кнопок, заповнення форм, перевірка результатів на екрані).\nОсобливості: Вони найбільш повільні, оскільки мають багато зовнішніх залежностей і вимагають автоматизації, яка здатна симулювати поведінку користувача."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Шо таке performance testing? Інструменти для цього.",
    "answer": "Тестування продуктивності (Performance Testing) – визначає наскільки тестований додаток стабільний, а також досліджує показники швидкості реакції програми на зовнішні впливи при різному за характером та інтенсивністю навантаження. Метою тестування є виявлення недоліків і вразливостей в системі, визначення швидкості завантаження даних і їх обробки, надійності програми.\nвизначення допустимої кількості користувачів додатка;\nвимірювання часу виконання тієї чи іншої операції системи;\nвизначення допустимих меж продуктивності програми з різними рівнями навантаження."
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Яка різниця між Верифікацією і Валідацією.",
    "answer": "Верифікація (Verification) – підтвердження того, що певні вимоги були виконані. При верифікації ми задаємо питання “Чи правильно створюється і тестується продукт?”\nВалідація (Validation) – перевірка того, що продукт відповідає очікуванням і потребам користувачів. При валідації – “Чи створюємо ми правильний продукт?”"
  },
  {
    "categoryId": "2-види-тестування",
    "question": "Різниця між авторизацією і аутентификацією?",
    "answer": "Автентифікація — це процедура автентифікації, наприклад, автентифікація користувача шляхом порівняння введеного ним пароля з паролем, збереженим у базі даних.\nАвторизація - надання певній особі або групі осіб прав на виконання певних дій."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Види тестової документації",
    "answer": "Тест план\nТест стратегія - визначає те, як тестуємо програмне забезпечення.Це набір ідей, які спрямовують процес тестування.\nЧек-лист\nТест-кейс\nТест-сюїт - комплект тест-кейсів для досліджуваного компонента чи системи.\nБаг репорт\nЗвіт про результати тестування - тут узагальнюються всі результати робіт із тестування.\nUse case - сценарій взаємодії користувача з про- грамним продуктом задля досягнення конкретної мети."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Шо таке Bug, Error, Failure",
    "answer": "Bug (defect) – помилка програміста (або дизайнера або ще кого, хто бере участь у розробці), тобто коли в програмі щось йде не так як планувалося і програма виходить з-під контролю. Наприклад, коли відсутня валідація полів і в результаті неправильні дані викликають краші або інші збої у роботі програми. Або всередині програма побудована так, що від самого початку не відповідає тому, що від неї очікується.\nFailure – збій (причому не обов'язково апаратний) у роботі компонента, всієї програми чи системи. Збій у роботі програми може бути індикатором наявності дефекту.\nError – помилка користувача, який намагається використовувати програму іншим способом. Наприклад, вводить літери в поля, де потрібно вводити цифри (вік, кількість товару тощо). У якіснійпрограмі передбачені такі ситуації та видаються повідомлення про помилку."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Різниця між Серйозністю і Приоритетом.",
    "answer": "Серйозність (Severity) – це атрибут, який охарактеризовує рівень впливу бага на загальну функціональність продукту, що тестується.\nПріоритет (Priority) – це атрибут, який визначає швидкість усунення бага."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Атрибути баг-репорта? Основні поля.",
    "answer": "Summary (Тема) – це короткий опис бага.\nDescription (Детальний опис) – більш широкий опис суті бага, якщо є така необхідність.\nSteps To Reproduce (Кроки для відтворення) – описані всі кроки, щоб можна було у точності відтворити помилку.\nActual result (Фактичний результат) – вказується, що працює не так, в якому місці продукту і за яких умов.\nExpected result (Очікуваний результат) – вказується, як саме має працювати система на думку тестувальника.\nAttachments (Вкладення). Це може бути, наприклад, скріншот, відео або лог-файл.\nPriority (Пріорітет дефекта).\nSeverity (Серйозність дефекта).\nStatus (Статус) – основний атрибут, що визначає поточний стан бага."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Шо таке тест-план. Які основні кроки.",
    "answer": "Test Plan – це документ, що описує весь обсяг робіт з тестування, починаючи з опису об’єкта, стратегії, розкладу, критеріїв початку і закінчення тестування, до необхідного в процесі роботи обладнання, спеціальних знань, а також оцінки ризиків з варіантами їх.\nМає відповідати на питання :\nЩо необхідно протестувати\nКоли необхідно протестувати\nЯк буде тестуватись\nЯкі критерії початку тестування\nЯкі критерії закінчення тестування\nОсновні пункти тест-плана :\nІдентифікатор тест-плана\nВступ\nОбєкт тестування\nФункції які будуть протестовані\nФункції які не будуть простестовані\nТестові підходи\nРезультати тестування\nЗадачі тестування\nРесурси системи\nОбовязки\nРолі і відповідальність\nРозклад\nОцінка ризиків"
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Test Strategy",
    "answer": "Test Strategy (Стратегія тестування) - це документ, який визначає загальний підхід до тестування програмного продукту. Він встановлює основні принципи, методи, ресурси та підходи, які будуть використовуватися під час тестування з метою досягнення якісного та ефективного результату.\nОгляд вимог і об'єкта тестування\nВизначення обсягу та покриття тестування\nВибір типів тестування\nВибір рівнів тестування\nВизначення тестового середовища\nПланування критеріїв валідації\nПланування критеріїв завершення\nПланування ресурсів та ролей"
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Test Summary Report",
    "answer": "Звіт про підсумки тестуванн) - після завершення тестового циклу або етапу тестування. Його головною метою є подання докладної інформації про виконані тестові активності, результати тестування та оцінку якості продукту.\nЗаголовок та ідентифікація\nВступ та огляд\nОгляд виконаних тестових активностей\nРезультати тестування та відхилення\nОцінка якості продукту\nЗвітність та критерії завершення тестування\nВисновки та рекомендації\nПідписи та підтвердження"
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Яка різниця між чек-листом і тест-кейсом.",
    "answer": "Чекліст (Check-list) – контрольний список, який містить ряд необхідних перевірок для тестування.\nЧек-лист може бути абсолютно різного рівня деталізації.\nЯк правило, чек-лист містить тільки дії (кроки) без очікуваного результату.\nЧек-лист менш формалізований ніж тест кейс.\nЧек-лист набагато легше підтримувати, ніж тест кейси.\nЧек листами не описуюють сложний фукціонал\nПункти чек-листа відповідають на питання “що тестувати?”, а конкретні кроки та деталі “як тестувати?” описують в тест кейсах.\nТест-кейс (Test Case) – це сукупність кроків, конкретних умов та параметрів, необхідних для перевірки реалізації тестованої функції або її частини.\n\nТест кейс складається з:\nID (ідентифікатор)\nTitle (назва)\nType (тип)\nPriority (пріоритет)\nPreconditions (передумови)\nSteps (кроки)\nExpected Result (очікуваний результат)\nPost conditions (пост умови) - наприклад, очищення даних або повернення системи в початковий стан."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Назвіть характеристики хорошого тест-кейсу?",
    "answer": "набір тестів не повинен бути надмірним\nтест-кейс не повинен бути надто простим чи, навпаки, складним;\nтест-кейс повинен бути точно визначеним;\nтест-кейс повинен бути уніфікованим;\nтест-кейс повинен бути однозначним і зрозумілим."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Які тестові кейси потрібно автоматизувати в першу чергу?",
    "answer": "Стабільність та частота виконання: Варто розглядати автоматизацію тих тестових кейсів, які виконуються дуже часто.\nТестування регресії: Ті які входять до регресії\nПовторювані кейси: Якщо є тестові сценарії, які потрібно виконувати в різних комбінаціях.\nВеликі обсяги даних: Якщо тестові кейси вимагають великі обсяги даних або повторюють одні й ті ж дії"
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Чи бувають задачі які непотрібно покривати Тест Кейсами?",
    "answer": "Очевидні функції: Деякі функції програмного продукту настільки очевидні та нескладні, що їх перевірка може вважатися зайвою. Наприклад, перевірка, чи можна відкрити додаток без помилок на стандартному обладнанні та операційній системі.\nТестування занадто рідкісних або нестандартних сценаріїв: Якщо сценарії є надзвичайно рідкісними або нестандартними і мають малу імовірність виникнення, то покриття їх тесткейсами може бути нецільовим.\nТестування функцій з низьким пріоритетом: У деяких випадках деякі функції можуть бути поміщені на задній план або мати низький пріоритет в порівнянні з іншими. Для таких функцій може бути розумним обмежити обсяг тестування.\nПодії або функції, що скоріше всього будуть видалені: Якщо ви знаєте, що певні функції або можливості продукту скоріше всього будуть видалені або змінені в майбутньому, то не варто витрачати."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Що таке Use Case/User Stories?",
    "answer": "Use Case (Сценарій користування) – це перелік дій, сценарій, за яким користувач взаємодіє з додатком або програмою для виконання будь-якої дії та досягнення конкретної мети.\nUser Story (Історія користувача) – це неформальне загальне пояснення функцій програмного забезпечення, написане з точки зору кінцевого користувача. Її мета полягає в тому, щоб сформулювати, яку цінність для замовника несе функціонал програмного забезпечення."
  },
  {
    "categoryId": "3-документація-qa",
    "question": "Може бути таке шо для проекту непотрібно ТК?",
    "answer": "Проекти з низьким бюджетом і коротким терміном: У випадку дуже обмежених ресурсів і коротких строків може бути розумніше обмежити написання тест-кейсів і намагатися провести якомога більше тестування в обмеженому часі.\nПрототипи і дослідницькі проекти: У проектах, де створюються прототипи, концепції або проводяться дослідницькі дослідження, може бути менш важливим писати тест-кейси. Гнучкість і швидкість реагування на зміни можуть бути пріоритетними.\nМаленькі і прості проекти: Для невеликих та простих проектів, де функціонал обмежений і очевидний, написання тест-кейсів може бути зайвим. Тут тестування може здійснюватися вручну без значної втрати продуктивності.\nПроекти з низьким ризиком і простою логікою: Якщо проект має низький рівень ризику, просту логіку та мінімальну кількість функцій, то тестування може здійснюватися шляхом ад-гок підходу без окремих тест-кейсів.\nПроекти для особистого використання або навчання: У випадку проектів, які ви розробляєте для власного використання або навчання, ви можете вибрати не писати тест-кейси, а просто тестувати функціонал за потреби."
  },
  {
    "categoryId": "4-тест-дизайн-техніки",
    "question": "Техніки тест дизайна.",
    "answer": "Граничні значення - Техніка тест-дизайну, яка спрямована на перевірку поведінки системи на граничних значеннях вхідних даних.\nПриклад : Знижка для віку від 20 до 60 років. Перевіряємо роботу системи на границях - 19 знижка не має діяти, - 20 знижка діє, - 60 знижка діє, - знижка не має діяти .\nКласи еквівалентності- Техніка, за якої ми поділяємо функціонал (часто діапазон можливих значень, що вводяться) на групи еквівалентних за своїм впливом на систему значень.\nПриклад : Форма на сайті, що запитує вік користувача перед тим, як надати доступ до контенту. Якщо користувачу менше 18 – показувати помилку та блокувати контент, якщо 18 та більше – показувати контент. В цьому випадку позитивних класів еквівалентності буде лише два: від 0 до 17, та від 18 до 100 .\nПередбачення помилки - Техніка на предмет того, щоб «вгадати», за яких вхідних умов система може видати помилку.\nПриклад : Користувач повинен ввести код. Тест аналітик буде думати: «Що, якщо я не введу код?», «Що, якщо я введу неправильний код?» І так далі. Це і є передбачення помилки.\nПарне тестування - Це техніка формування наборів тестових даних з повного набору вхідних даних в системі, яка дозволяє істотно скоротити кількість тест-кейсів. Прибрати надлишкові перевірки, забезпечити гарне тестове покриття,виявити найбільшу кількість багів на мінімальному наборі тестів.\nПриклад : У нас є 6 фільтрів, в кожному фільтрі є 10 варіантів. Щоб перевірити кожен варіант фільтрування то потрібно десятки тисяч тестів, щоб скоротии беремо попарно, першиц фільтр один варіан, другий фільтр один варіант і тестується пара, так само і третій і четверитй, пятий і шостий.\nВичерпне тестування - Це крайній випадок. В межах цієї техніки перевіряються всі можливі комбінації вхідних значень, які повинні знайти всі проблеми. На практиці застосування цього методу не представляється можливим через величезну кількість вхідних значень.\nПричина – Наслідок - це, як правило, введення комбінацій умов (причин) для отримання відповіді від системи (наслідок).\nПриклад : Користувач заповнив свої персональні дані форма персональних даних де “Причина”, нажимає кнопку зберегти. Після натискання кнопки «Зберегти», система додає клієнта в базу даних і показує його номер на екрані – це «Наслідок».\nТаблиця прийняття рішень - це техніка, що допомагає зобразити складну комбінаторику умов з ТЗ.\nУмови: Це опис того, що трапляється або може трапитися. У нашому випадку, це можуть бути різні способи введення логіна і пароля користувачем.\nДії: Це те, що ми робимо в реакції на умову. В нашому випадку, це дії, які система виконує, наприклад, дозволяє доступ, виводить повідомлення про помилку або блокує обліковий запис користувача.\nРезультати: Це те, що відбувається як наслідок дій в реакції на умову. В нашому випадку, результат може бути успішним входом, невдалими спробами або заблокованим обліковим записом."
  },
  {
    "categoryId": "4-тест-дизайн-техніки",
    "question": "Переваги Парного Тестування:",
    "answer": "Зменшення кількості тестів: Ви тестуєте всі можливі пари значень параметрів, що суттєво зменшує кількість тестів.\nЕфективність: Ця техніка дозволяє знайти більшість дефектів, які виникають через взаємодію двох параметрів, без необхідності тестування всіх можливих комбінацій.\nЕкономія ресурсів: Менша кількість тестів означає меншу кількість часу та ресурсів, необхідних для їх виконання."
  },
  {
    "categoryId": "4-тест-дизайн-техніки",
    "question": "Для чого використовують еквівалентне розбиття?",
    "answer": "Зменшення кількості тестів: Замість випробовування кожної можливої комбінації вхідних даних, еквівалентне розбиття допомагає групувати дані у класи\nПідвищення ефективності: Еквівалентне розбиття допомагає визначити тільки найважливіші представники класів даних\nЗабезпечення покриття різних сценаріїв: Це дозволяє забезпечити більше покриття функціоналу програми\nЗменшення вразливості помилок: Якщо тест одного представника класу показує проблему, це може вказувати на наявність проблеми у всьому класі."
  },
  {
    "categoryId": "4-тест-дизайн-техніки",
    "question": "Чому потрібно тестувати граничні значення?",
    "answer": "Виявлення помилок: Граничні значення часто можуть викликати незвичайні поведінки програми\nПеревірка коректності обмежень: Багато програм мають обмеження для вхідних даних або параметрів.\nЗабезпечення повноти тестування: Тестування граничних значень допомагає забезпечити повноту тестування, оскільки воно включає у себе тести, які перевіряють найскладніші умови та можливі варіації вхідних даних."
  },
  {
    "categoryId": "4-тест-дизайн-техніки",
    "question": "Принципи тестування",
    "answer": "Тестування не гарантує 100% відсутності багів\nВичерпне тестування неможливе\nЧим швидше розпочато тестування то краще\n20% модулів тримають 80% багів\nПарадокс пестицидів\nТестуванна залежить від контексту\nВідсутність дефектів неможливе"
  },
  {
    "categoryId": "5-вимоги",
    "question": "Які бувають вимоги?",
    "answer": "Технічні вимоги : - це детальні специфікації технічних характеристик та властивостей програмного продукту, які потрібні для його правильної роботи, інтеграції та підтримки.\nАрхітектурні вимоги: Опис структури продукту, його компонентів та взаємодій між ними.\nВимоги до продуктивності: Вимоги щодо швидкодії, завантаження, масштабованості тощо.\nВимоги до безпеки: Вимоги до захисту даних, аутентифікації, авторизації та інших аспектів безпеки.\nТехнічні обмеження: Визначення технічних параметрів, таких як підтримувані операційні системи,\nБізнес-вимоги : - це опис потреб бізнесу або користувачів, які визначають, яку цінність має надавати програмний продукт та які проблеми він повинен вирішувати.\nБізнес-вимоги\nНавіщо створюється продукт?\nЯка користь з продукту?\nЯк отримати прибуток з продукту?\nКористувацькі вимоги\nЩо користувач може робити з допомогою продукту?\nПродуктові вимоги\nФункціональні: Що система повинна робити?\nНефункціональні: Як система має це робити?\nПродуктивність\nДокументація"
  },
  {
    "categoryId": "5-вимоги",
    "question": "Вимоги до документації",
    "answer": "Вимоги - це специфікація (опис) того, що має бути реалізовано. Вимоги описують те, що необхідно реалізувати, без деталізації технічного боку рішення. “Що”, а не “як”.\nКоректність: Вимоги повинні бути точними та відображати реальні потреби користувачів.\nНедвозначність: Вимоги мають бути сформульовані так, щоб не залишати місця для різних інтерпретацій.\nПовнота: Вимоги повинні включати всі необхідні деталі для повного розуміння того, що потрібно реалізувати.\nНесуперечність: Вимоги повинні бути відсутніми суперечності та логічних конфліктів між собою.\nУпорядкованість за важливістю та стабільністю: Вимоги повинні бути впорядковані так, щоб спочатку реалізовувались найважливіші та стійкі до змін аспекти.\nПеревірюваність (тестопридатність): Вимоги повинні бути сформульовані так, щоб їх можна було легко перевірити шляхом тестування.\nМодифікованість: Вимоги повинні бути сформульовані так, щоб їх можна було легко змінювати або розширювати в майбутньому.\nТрасування: Вимоги мають бути такими, щоб можна було відслідковувати, звідки вони походять та як вони взаємодіють між собою.\nЗрозумілість: Вимоги повинні бути сформульовані зрозуміло та доступно для всіх зацікавлених сторін."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Definition of Ready & Definition of Done",
    "answer": "Definition of Done (визначення завершеності) - це визначений набір критеріїв і вимог, які повинні бути виконані для того, щоб вважати робочий елемент, завдання або проект повністю завершеними і готовими до випуску.\nПриклади : Всі кріт і блок баги закриті, всі зміни фіксів задеплоїні на тест енв.\nDefinition of Ready (визначення готовності) - це набір критеріїв і вимог, які повинні бути виконані перед тим, як робочий елемент, завдання або проект можна буде включити до активного процесу розробки чи виконання.\nПриклади : API, доступи, бекенд готовий, дизайн готовий."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Що таке критерії входу і виходу?",
    "answer": "Критерії входу (Entry Criteria):\nКритерії входу - це умови або характеристики, які повинні бути задоволені перед початком певної діяльності. Ці умови гарантують, що необхідні ресурси, інформація та середовище належним чином підготовлені для початку роботи. Критерії входу допомагають запобігти ризикам та незручностям, які можуть виникнути в разі неповної або неправильної підготовки.\nПриклади : Критерії входу можуть включати підготовку тестового середовища, завантаження необхідних даних, налаштування тестових засобів тощо.\nКритерії виходу (Exit Criteria):\nКритерії виходу - це умови або характеристики, які повинні бути виконані, щоб завершити певну діяльність або етап. Вони вказують на те, коли певна робота може бути вважена закінченою і готовою для переходу до наступного етапу. Критерії виходу забезпечують якість та готовність результуючої роботи для подальшого використання або аналізу.\nПриклади : Критерії виходу можуть включати виконання всіх запланованих тестових кейсів, звіт про результати тестування, виправлення виявлених дефектів до певного рівня тощо."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Критерії запуска і критерії припинення тестування.",
    "answer": "Тестування потрібно починати ще на етапі створення вимог до системи.\nЗакінчення тестування, пройдені всі тести, не знаходимо нові баги."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Requirements Review Techniques",
    "answer": "Requirements Review Techniques (Техніки огляду вимог) - це методи та підходи, які використовуються для перегляду та оцінки вимог до програмного продукту з метою забезпечення їх коректності, повноти та відповідності бізнес-потребам.\nPeer Review (Огляд колегами):Визначення: Peer Review - це процес перегляду вимог, який проводиться колегами члена команди або експертами, які володіють досвідом у сфері вимог або домену.\nWalkthrough (Прогулянка):Визначення: Walkthrough - це інтерактивний процес, під час якого автор вимог пояснює та демонструє їх іншим членам команди або зацікавленим сторонам.\nInspection (Інспекція):Визначення: Inspection - це структурований процес систематичного огляду вимог, під час якого залучаються представники різних ролей, включаючи автора, оглядачів та модератора.\nRequirements Review Meetings (Зустрічі для огляду вимог): Визначення: Зустрічі для огляду вимог - це формальні або неформальні зібрання членів команди, під час яких обговорюються та переглядаються вимоги."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Traceability matrix (Матриця відповідності вимог)",
    "answer": "Traceability matrix - це двовимірна таблиця, що містить відповідність функціональних вимог та тест кейсів.\nУ заголовках колонок таблиці розташовані вимоги, а в заголовках рядків – ID тест кейсів.\nНа перетині — позначка, що означає, що вимога поточної колонки покрита тестовим сценарієм поточного рядка."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Шо робити коли некорекнто написана задача, нечіткі вимоги?",
    "answer": "Піти до БА за уточненнями, можна звернутись до ПМ або Бізнес Овнер."
  },
  {
    "categoryId": "5-вимоги",
    "question": "Як виміряти покриття фічей?",
    "answer": "Щоб виміряти покриття вимог потрібно скористуватись трайсебілі матрицею, визначити кількість всього вимог у нас є , кількість вимог у нас покриті і використати наступну формулу\nПокриття вимог = кількість покритий вимог  / кільскість всіх вимог * 100%"
  },
  {
    "categoryId": "5-вимоги",
    "question": "Коли краще приступати до тестування?",
    "answer": "Приступати до тестування потрібно починати ще на етапі створення вимог до системи."
  },
  {
    "categoryId": "6-qa-process",
    "question": "Modeling and Planning",
    "answer": "Моделювання та планування- це процес розробки плану тестування, включаючи створення моделей, які допомагають зорієнтувати тестувальний процес та забезпечити ефективність тестування.\nRequirements Analysis (Аналіз вимог)\nTest Strategy and Approach (Стратегія та підхід до тестування)\nTest Planning (Планування тестування)\nTest Estimation (Оцінка тестування)\nTest Design and Coverage (Проектування та покриття тестування)"
  },
  {
    "categoryId": "6-qa-process",
    "question": "Control and Maintenance",
    "answer": "Контроль та підтримка - це процес виконання та контролювання тестування, а також забезпечення стабільності та ефективності тестового процесу протягом усього життєвого циклу проекту.\nTest Execution and Monitoring (Виконання та моніторинг тестування): Виконання тестування відповідно до плану, відстеження його ходу та результатів, а також реагування на виявлені дефекти та відхилення.\nChange Management (Управління змінами): Управління змінами - це процес керування змінами в програмному продукті, які можуть вплинути на тестування та тестовий процес.\nDefect Management (Управління дефектами): Визначення: Управління дефектами - це процес виявлення, документування, відстеження та вирішення дефектів, які виявлені під час тестування.\nRegression Testing (Регресійне тестування): Регресійне тестування - це процес перевірки того, чи не виникли нові дефекти або відхилення під час внесення змін у програмний продукт.\nTest Closure (Завершення тестування): Завершення тестування - це процес оцінки результатів тестування, створення відповідних звітів та підготовки до завершення проекту."
  },
  {
    "categoryId": "6-qa-process",
    "question": "QA Metrics",
    "answer": "QA Metrics (Метрики якості (QA) - це числові показники та вимірювання, які використовуються для оцінки якості тестування та якості програмного продукту. Вони надають об'єктивну інформацію про рівень виконання тестових завдань, якість вимірюваного продукту та ефективність тестування.\nTest Coverage Metrics (Метрики покриття тестування):\nDefect Metrics (Метрики дефектів):\nExecution Metrics (Метрики виконання тестів)\nTest Efficiency Metrics (Метрики ефективності тестування):"
  },
  {
    "categoryId": "6-qa-process",
    "question": "Тест метрики",
    "answer": "Passed/Failed Test Cases\nNot Run Test Cases.\nOpen/Closed Bugs.\nReopened/Closed Bugs\nBugs by Severity/Priority."
  },
  {
    "categoryId": "6-qa-process",
    "question": "Різниця між bug leakage і bug release?",
    "answer": "Bug release — це баги, які були випущені в реліз та команда розробки про них знає.\nBug leakage — це невідомі команді розробки баги, які знаходять користувачі після релізу."
  },
  {
    "categoryId": "7-ризики",
    "question": "Project and Product Risks",
    "answer": "Ризики проекту та продукту - це потенційні небезпеки або негативні події, які можуть вплинути на успішність проекту та якість продукту. Вони вказують на можливість виникнення проблем, що можуть призвести до затримок, перевищення бюджету, невдоволеності замовника, низької якості продукту тощо.\nProject Risks (Ризики проекту): Це ризики, пов'язані з управлінням та виконанням проекту, такі як затримки, недостатній бюджет, недосягнення цілей проекту тощо.\nProduct Risks (Ризики продукту): Це ризики, пов'язані з якістю та функціональністю програмного продукту, такі як дефекти, невідповідність вимогам, низька надійність тощо.\nRisk Assessment and Mitigation (Оцінка та пом'якшення ризиків):Це процес визначення, аналізу та зниження впливу ризиків на проект та продукт.\nRisk Monitoring and Control (Моніторинг та контроль ризиків): Визначення: Це процес відстеження та керування ризиками протягом усього проекту."
  },
  {
    "categoryId": "7-ризики",
    "question": "Risk Assessment and Control",
    "answer": "Оцінка та контроль ризиків - це процес виявлення потенційних ризиків, оцінка їхнього впливу та ймовірності, розробка стратегій зменшення впливу ризиків на проект та його результати, а також моніторинг та керування ризиками протягом усього життєвого циклу проекту.\nRisk Identification (Виявлення ризиків): Це процес ідентифікації потенційних ризиків, які можуть вплинути на проект та його результати.\nRisk Assessment (Оцінка ризиків):Це процес визначення потенційного впливу та ймовірності виникнення ризиків, що дозволяє встановити їх пріоритетність та важливість.\nRisk Mitigation Planning (Планування зменшення ризиків): Це процес розробки стратегій та планів для зменшення впливу ризиків на проект або для підготовки до їхнього виникнення.\nRisk Monitoring and Control (Моніторинг та контроль ризиків): Це процес постійного відстеження стану ризиків, виявлення нових ризиків та впровадження заходів для їхнього контролю та управління.\nRisk Reporting (Звітність про ризики): Це процес документування та звітування про стан ризиків, їхній вплив та ступінь контролю."
  },
  {
    "categoryId": "8-qa-estimaton",
    "question": "Testing Estimation Techniques",
    "answer": "Техніки оцінки тестування - це методи та підходи, які використовуються для визначення часу, зусиль та ресурсів, необхідних для виконання тестування певного програмного продукту чи проекту. Оцінка тестування допомагає визначити реалістичний план та бюджет для тестової діяльності.\nExpert Judgment (Експертна оцінка): Використання знань та досвіду експертів у галузі тестування для прийняття обґрунтованих оцінок.\nAnalogous Estimation (Аналогова оцінка): Використання даних з попередніх аналогічних проектів для прогнозування вимог для поточного проекту.\nParametric Estimation (Параметрична оцінка): Використання математичних моделей та статистичних методів для оцінки на основі параметрів проекту.\nBottom-Up Estimation (Оцінка \"знизу вгору\") - Оцінка окремих компонентів чи робіт та їх об'єднання для отримання загальної оцінки.\nThree-Point Estimation (Оцінка за трьома точками) - Використання трьох оцінок - найоптимістичнішої, найбільш реалістичної та найпесимістичнішої - для визначення середньої оцінки."
  },
  {
    "categoryId": "8-qa-estimaton",
    "question": "Estimation Factors",
    "answer": "Estimation Factors (Фактори оцінки) - це різноманітні чинники та аспекти, які враховуються при проведенні оцінки трудовитрат, ресурсів, тривалості та вартості на реалізацію проекту, включаючи тестувальні дії та завдання. Ці фактори впливають на точність оцінки та допомагають уникнути підцінки або переоцінки необхідних зусиль.\nSize of the Project/Product (Розмір проекту/продукту): Розмір програмного продукту або обсяг робіт в проекті визначаються числом компонентів, рядків коду, функціональних точок тощо.\nComplexity (Складність): Складність вимірюється рівнем взаємодії між компонентами, алгоритмічною складністю, кількістю взаємодіючих систем та іншими факторами.\nExperience and Skills of the Team (Досвід та навички команди): Рівень досвіду, навичок та експертизи команди розробників та тестувальників.\nTechnology and Tools (Технології та інструменти): Використовувані технології, платформи, мови програмування, фреймворки та інструменти.\nRequirements Clarity (Чіткість вимог): Рівень чіткості та деталізації вимог до продукту або проекту.\nChange Management (Управління змінами): Частота та розмір змін у вимогах або завданнях під час"
  },
  {
    "categoryId": "9-репорти",
    "question": "Sprint & Release Report",
    "answer": "Звіт про спринт та реліз - це документ, який містить інформацію про виконану роботу та досягнуті результати під час окремого спринту або під час випуску (релізу) програмного продукту. Цей звіт надає інформацію команді проекту, керівництву, замовнику та іншим зацікавленим сторонам про стан проекту та результати тестування.\nSprint Report (Звіт про спринт) : Це документ, який описує досягнення команди розробки та тестування під час конкретного спринту в методології розробки Scrum.\nRelease Report (Звіт про реліз): Це документ, який надає інформацію про випуск програмного продукту, включаючи результати тестування та готовність для введення в експлуатацію.\nKey Metrics and Performance Indicators (Ключові метри та показники продуктивності): Це числові показники та метри, які відображають стан та продуктивність проекту або релізу.\nLessons Learned (Вивчені уроки): Огляд вивчених уроків та підходів, які можуть бути використані для покращення майбутніх спринтів або релізів."
  },
  {
    "categoryId": "9-репорти",
    "question": "Project Release Activities",
    "answer": "Project Release Activities (Дії під час випуску проекту) - це сукупність завдань та процесів, які виконуються для успішного впровадження та випуску програмного продукту на ринок або для завершення проекту. Ці дії включають підготовку продукту до випуску, тестування, документацію, внутрішню та зовнішню комунікацію та інші етапи, необхідні для успішного завершення проекту.\nFinal Testing and Quality Assurance (Остаточне тестування та забезпечення якості): Проведення остаточних тестів для переконання в тому, що продукт готовий до випуску та відповідає вимогам.\nDocumentation and User Guides (Документація та посібники для користувачів): Підготовка всієї необхідної документації, яка супроводжує випуск продукту.\nRelease Planning and Coordination (Планування та координація випуску): Організація та планування дій для випуску продукту на ринок або для завершення проекту.\nCommunication and Marketing (Комунікація та маркетинг): Планування та здійснення зовнішньої та внутрішньої комунікації щодо випуску продукту.\nSupport and Maintenance Planning (Планування підтримки та обслуговування): Планування підтримки та обслуговування після випуску продукту."
  },
  {
    "categoryId": "9-репорти",
    "question": "Як проходить тест фічі від опен до клоуз всі степи.",
    "answer": "Задача в РФТ\nПереводимо в Тест\nЗбираємо білд\nТестуємо\nЯкшо є баги то лінкуємо і кидаємо в Реопен\nЯкшо ні то кидаємо в Реді ту реліз"
  },
  {
    "categoryId": "9-репорти",
    "question": "Що таке canary release",
    "answer": "Canary release — це стратегія розгортання, при якій нова версія програмного забезпечення (або окремий функціонал) випускається для обмеженого кола користувачів перед повним релізом. Це дозволяє виявити потенційні проблеми на ранніх етапах і знизити ризики для всієї системи."
  },
  {
    "categoryId": "10-api",
    "question": "Шо таке Клієнт-серверна архітектура.",
    "answer": "Модель такої системи полягає в тому, що клієнт відправляє запит на сервер, де він обробляється, і готовий результат відправляється клієнтові. Сервер може обслуговувати кілька клієнтів одночасно. Якщо одночасно приходить більше одного запиту, то вони встановлюються в чергу і виконуються сервером послідовно. Іноді запити можуть мати пріоритети. Запити з більш високими пріоритетами повинні виконуватися раніше.\nДворівнева архітектура складається з двох вузлів:\nКліент і Сервер, який відповідає за отримання запитів і відправку відповідей клієнту, використовуючи при цьому лише власні ресурси;\nТрирівнева архітектура складається з наступних компонентів:\nПринцип роботи полягає в тому, що декілька серверів обробляють запит клієнта. Розподіл операцій знижує навантаження на сервер.\nБагаторівневої архітектура складається з наступних компонентів:\nвстановлення додаткових серверів. Багаторівнева архітектура дозволяє підвищити ефективність роботи інформаційної системи, а також оптимізувати розподіл її програмно-апаратних ресурсів."
  },
  {
    "categoryId": "10-api",
    "question": "Шо таке REST API, SOAP? Різниця?",
    "answer": "SOAP - це протокол обміну повідомленнями на основі XML,\nREST - архітектурний стиль.\nREST працює тільки за HTTP/HTTPS, SOAP з будь-яким протоколом прикладного рівня: SMPT, FTP, HTTP, HTTPS, POP3.\nREST більш простий, гнучкий і швидкий, SOAP типізований, але в деяких випадках краще візуалізується за рахунок застосування синтаксису схожого на HTML розмітку."
  },
  {
    "categoryId": "10-api",
    "question": "URL (або Uniform Resource Locator)",
    "answer": "URL  - це адреса, яка ідентифікує ресурс в Інтернеті. URL складається з декількох частин, які вказують на протокол, домен, шлях і можливі параметри запиту. Ось загальна структура формування URL-адреси:\nПротокол (protocol): Це вказує на тип протоколу, який використовується для доступу до ресурсу. Наприклад, \"http\", \"https\", \"ftp\", \"mailto\" і так далі.\nДомен (domain): Це ім'я або IP-адреса сервера, на якому знаходиться ресурс. Наприклад, \"www.example.com\".\nПорт (port): Необов'язковий параметр, який вказує на номер порта сервера для з'єднання. Це зазвичай не вказується, і браузер автоматично вибирає правильний порт в залежності від протоколу. Наприклад, порт 80 для HTTP і порт 443 для HTTPS.\nШлях (path): Це шлях до конкретного ресурсу на сервері. Вказується відносно кореня сервера. Наприклад, \"/products/page1.html\".\nПараметри запиту (query parameters): Необов'язкові параметри, які можуть бути передані серверу для додаткового налаштування або фільтрації запиту. Вони розділяються символом \"?\" від шляху і між собою можуть бути розділені символом \"&\". Наприклад, \"?category=electronics&sort=price\".\nФрагмент (fragment): Необов'язковий параметр, який вказує на конкретний фрагмент або розділ в ресурсі, який слід відобразити. Він вказується за допомогою символа \"#\". Наприклад, \"#section3\"."
  },
  {
    "categoryId": "10-api",
    "question": "API (Application Programming Interface)",
    "answer": "API (Application Programming Interface) - це спосіб, який дозволяє різним програмам і системам взаємодіяти одна з одною. У мові простих слів, це як інструкції, за допомогою яких одна програма може розмовляти з іншою"
  },
  {
    "categoryId": "10-api",
    "question": "Що таке ідемпотентність в API апитах?",
    "answer": "GET-запит є ідемпотентним, оскільки при його повторенні результат запиту не змінюється. Тобто, якщо ви відправите GET-запит кілька разів, кожен з них матиме однаковий ефект, і сервер не змінить стан ресурсу. Наприклад, запит на отримання даних користувача не змінить цих даних, навіть якщо ви виконаєте цей запит кілька разів.\nPOST-запит не є ідемпотентним, оскільки кожен новий запит POST може змінювати стан ресурсу, створюючи нові дані чи виконуючи інші операції, що змінюють серверний стан. Наприклад, при створенні нового запису в базі даних кожен POST-запит може створювати новий запис."
  },
  {
    "categoryId": "10-api",
    "question": "Протоколи передачі даних.",
    "answer": "TCP (Transfer Control Protocol) – протокол, який служить для встановлення надійного з'єднання між двома пристроями, він провіряє чи користувач отримав дані, якшо ні то ще раз надішле.\nIP (Internet Protocol) – інтернет протокол, який відповідає за правильність доставки повідомлень за певною адресою. При цьому дані розбиваються на пакети, які можуть доставлятися по-різному.\nHTTP (Hyper Text Transfer Protocol) – протокол передачі гіпертексту, на основі якого працюють всі сайти. Він запитує необхідні дані у віддаленій системи (веб-сторінки, файли).\nFTP (File Trasfer Protocol) – протокол передачі файлів зі спеціального файлового сервера на комп'ютер користувача.\nPOP3 - це стандартний протокол для отримання пошти з віддалених серверів на локальний клієнт.\nSMTP – (Simple Mail Transfer Protocol) — це комунікаційний протокол для пересилання електронної\nTelnet — мережевий протокол для реалізації текстового інтерфейсу по мережі."
  },
  {
    "categoryId": "10-api",
    "question": "Топ 15 самих частих Status Code",
    "answer": "200 OK: Запит був успішно оброблений, і відповідь містить необхідні дані.\n201 Created: Запит був успішно оброблений, і новий ресурс був створений як результат.\n204 No Content: Запит був успішно оброблений, але відповідь не містить контенту (зазвичай використовується при успішному видаленні ресурсу).\n400 Bad Request: Запит містить некоректні дані або не може бути оброблений сервером.\n401 Unauthorized: Клієнт не має дозволу на доступ до ресурсу, або потрібна аутентифікація.\n403 Forbidden: Клієнт має аутентифікацію, але не має дозволу на доступ до запитаного ресурсу.\n404 Not Found: Ресурс не знайдено на сервері.\n405 Method Not Allowed: Запитаний HTTP-метод не підтримується для даного ресурсу.\n500 Internal Server Error: Сталася внутрішня помилка на сервері, яка перешкоджає обробці запиту.\n502 Bad Gateway: Сервер, який використовується як посередник, отримав некоректну відповідь від\n503 Service Unavailable: Сервер тимчасово не може обробити запит через перевантаження або технічні\n504 Gateway Timeout: Сервер, який використовується як посередник, не отримав відповідь вчасно від сервера, до якого він звертався.\n401 Not Implemented: Запитаний функціонал ще не реалізований на сервері.\n409 Conflict: Конфлікт у ресурсі, наприклад, при спробі створення ресурсу з вже існуючим ідентифікатором.\n429 Too Many Requests: Клієнт зробив занадто багато запитів за короткий час і перевищив ліміт на швидкість запитів."
  },
  {
    "categoryId": "10-api",
    "question": "Методі АПІ . Яка різниця .",
    "answer": "GET: Використовується для запиту ресурсу з сервера. Коли ви відкриваєте веб-сторінку в браузері, він використовує метод GET для отримання вмісту цієї сторінки.\nPOST: Використовується для відправлення даних на сервер для обробки. Зазвичай використовується для створення нового ресурсу на сервері.\nPUT: Використовується для оновлення існуючого ресурсу на сервері. Ви можете використовувати цей метод, щоб змінити інформацію про ресурс.\nDELETE: Використовується для видалення ресурсу на сервері. Після використання цього методу ресурс буде видалений.\nPATCH: Схожий на метод PUT, але використовується для часткового оновлення ресурсу. Ви можете використовувати цей метод, щоб змінити лише деякі частини ресурсу, не впливаючи на всю його структуру.\nHEAD: Аналогічний методу GET, але сервер повертає лише заголовки відповіді, без самого вмісту. Використовується, наприклад, для отримання інформації про ресурс без його фактичного завантаження.\nCONNECT: Використовується для встановлення мережевого з'єднання з ресурсом, який може відповідати на запити на декількох портах. Зазвичай використовується для створення HTTPS тунелів через проксі.\nTRACE: Використовується для відправлення тестового запиту на сервер з метою отримання зворотного відгуку. Цей метод часто використовується для діагностики, але він може бути небезпечним, якщо не налаштований належним чином.\nOPTIONS: Помилка у попередньому відповіді. Метод OPTIONS використовується для отримання інформації про можливі методи, які підтримує сервер для конкретного ресурсу. Також він може повертати іншу корисну інформацію, таку як дозволені заголовки тощо.\nLINK і UNLINK: Ці методи використовуються для створення або видалення зв'язків між ресурсами на сервері. Вони дозволяють створювати \"посилання\" між ресурсами або видаляти ці посилання.\nPURGE: Цей метод використовується для видалення кешованих даних на сервері або проксі-сервері. Хоча цей метод не є стандартом HTTP, деякі веб-сервери та проксі його підтримують.\nCOPY і MOVE: Ці методи використовуються для копіювання або переміщення ресурсів з одного місця на інше на сервері."
  },
  {
    "categoryId": "10-api",
    "question": "Шо відбувається коли користувач вводить запит в браузері?",
    "answer": "Звертаємось до DNS шоб отримати IP яка закріплення за даним доменом.\nПровіряється кеш браузера.\nЙде запит на сервер.\nВідповідь від сервера.\nКешування.\nАналіз отриманих даних з сервера і відрисовка сайта."
  },
  {
    "categoryId": "10-api",
    "question": "Як розшифровується CRUD?",
    "answer": "Create, Read, Update, Delete"
  },
  {
    "categoryId": "10-api",
    "question": "Статус коди (1хх; 2xx; 3xx; 4xx; 5xx).",
    "answer": "100- Інформаційні\n200 – Успіх\n300 – Переадресація\n400 - Проблеми на стороні клієнта\n500 - Проблеми на стороні сервера"
  },
  {
    "categoryId": "10-api",
    "question": "OSI (Open Systems Interconnection)",
    "answer": "OSI (Open Systems Interconnection) - це стандартна модель мережевої архітектури, яка описує процес передачі даних через комп'ютерні мережі. Вона складається з сімох рівнів, кожен з яких відповідає за певні аспекти мережевої комунікації. Давайте розглянемо кожен рівень OSI моделі з прикладами:\nФізичний рівень (Physical Layer): На цьому рівні передаються біти через кабелі\nКанальний рівень (Data Link Layer): Макадрес мого ноута зєднуєтсья з макадресом мого роутера\nМережевий рівень (Network Layer): На цьому рівні бетерться мій IP-адрес і визначається куди шлемо\nТранспортний рівень (Transport Layer): Протокол TCP ( без втрати ) UPD ( швидкий з втратою ).\nСеансовий рівень (Session Layer): Цей рівень відкриває і підтримує сесії ( phpssid ).\nПредставлення (Presentation Layer): Шифрування даних тексти в байти.\nПрикладний рівень (Application Layer): додатки та сервіси через HTTP, HTTPS, FTP, SMTP, WebSocket"
  },
  {
    "categoryId": "10-api",
    "question": "Які типи даних можуть передаватись з JSON?",
    "answer": "Рядок (String) – текст у подвійних лапках ( “Іван” , “Петро” )\nЧисло (Number) – може бути цілим або з плаваючою комою ( 4 , 3.12 і тд )\nОб'єкт (Object) – набір пар \"ключ\": значення ( \"name\": \"John\",  \"age\": 30 )\nМасив (Array) – впорядкована колекція значень ( [1, 2, 3, \"hello\", true] )\nБулевий тип (Boolean) – логічні значення true або false.\nNull – спеціальне значення, що означає \"відсутність даних\"."
  },
  {
    "categoryId": "10-api",
    "question": "Яка різниця між колекцією і оточенням в Postman?",
    "answer": "Колекція — це організація запитів, що дозволяє групувати їх для зручності.\nОточення — це набір змінних, який дозволяє адаптувати запити до різних середовищ без редагування кожного запиту вручну."
  },
  {
    "categoryId": "10-api",
    "question": "Які види змінних є у Postman?",
    "answer": "Global Variables — ​​Глобальні змінні доступні в усіх робочих просторах і запитах Postman.\nCollection Variables — Прив’язані до конкретної колекції запитів. Використовуються тільки всередині цієї колекції.\nEnvironment Variables — Прив’язані до певного середовища (наприклад, dev, staging, prod). Можна швидко переключати середовища.\nData Variables — Використовуються при запуску колекції з файлом даних (CSV або JSON) у Collection Runner."
  },
  {
    "categoryId": "10-api",
    "question": "Чи можемо створити об'єкт на серваку з допомогою  Get?",
    "answer": "Так можемо, але дані будуть передаватись через квері параметри у відкритому виді."
  },
  {
    "categoryId": "10-api",
    "question": "Як витянути логи з Postman",
    "answer": "Зробити запит, знизу в футері є Console, відкрити його і скопіювати"
  },
  {
    "categoryId": "10-api",
    "question": "А шо буде якшо в  Get засунути body ?",
    "answer": "Залежить від налаштувань бека, зазвичай має просто ігноритись, але може бути і помилка 407"
  },
  {
    "categoryId": "10-api",
    "question": "Які з запитів кешуються?",
    "answer": "Get - Основний і найчастіше кешований.\nHead - Аналогічний GET, але без тіла відповіді.Кешується так само, як GET, якщо сервер дозволяє.\nНе кешуються : POST , PUT , PATCH , DELETE  ( Бо вони змінюють стан сервера, і повторення відповіді з кешу може зламати логіку )"
  },
  {
    "categoryId": "10-api",
    "question": "Які проблеми можуть бути якшо ми нажимаємо кнопку ввійти і нічого не происходить?",
    "answer": "Неклікабельна кнопка\nЄ помилка яка не висвітлюється на UI\nПідключаємо фідлер і аналізуємо де проблема\nЧи на стороні користувача 400-ті , чи на стороні бека 500-ті."
  },
  {
    "categoryId": "10-api",
    "question": "WebSocket",
    "answer": "WebSocket - це технологія, яка дозволяє веб-сайтам та додаткам встановлювати постійне двостороннє з'єднання з веб-сервером. Це означає, що інформація може передаватися між браузером або додатком і сервером безпосередньо та в реальному часі, навіть якщо користувач не натискає на кнопки чи не оновлює сторінку."
  },
  {
    "categoryId": "10-api",
    "question": "Реляційні бази даних.",
    "answer": "Реляційні бази даних — це тип баз даних, які зберігають і організовують дані в таблицях. Основою реляційної бази даних є використання відносин (relations), що дозволяє пов'язувати дані між різними таблицями за допомогою ключів.\nПервинний ключ (Primary Key)\nЗовнішній ключ (Foreign Key)"
  },
  {
    "categoryId": "11-git-і-gitlab",
    "question": "Що таке GIT",
    "answer": "Git - це програмне забезпечення для контролю версій. Дозволяє вам відстежувати зміну , яку ви і ваша команда робіть під час розробки програмного забезпечення.\nОсновну вітку ще всього називають master. Якщо говорити простими словами, то вітка master - це наш проект.\nІнші вітки - це окреме місце для реалізації нового функціоналу або виправлення багів  нашого проекту.\ngit add - додає вміст робочої директорії індекс (staging area) для наступного коммита.\ngit status - показує стан файлів у робочій директорії та індексі: які файли змінені, але не додані в індекс; які очікують на комміт в індексі.\ngit diff - використовується для обчислення різниці між будь-якими двома Git деревами. Це може бути різниця між вашою робочою директорією та індексом (власне git diff), різниця між індексом та останнім комітом.\ngit commit - бере всі дані, додані до індексу за допомогою git add, і зберігає їх зліпок у внутрішній базі даних, а потім зрушує покажчик поточної гілки на цей зліпок.\ngit reset - як можна здогадатися з назви, використовується переважно для скасування змін.\ngit branch - це свого роду \"менеджер гілок\". Вона вміє перераховувати ваші гілки, створювати нові, видаляти та перейменовувати їх.\ngit merge - використовується для злиття однієї або декількох гілок у поточну. Потім вона встановлює покажчик поточної гілки на результуючий коміт.\ngit fetch - пов'язується з віддаленим репозиторієм і забирає з нього всі зміни, яких у вас поки що немає і зберігає їх локально.\ngit push - використовується для встановлення зв'язку з віддаленим репозиторієм.\ngit checkout – використовується для переключення між гілками , коли є багато локальних гілок і потрібнол перейти на іншу."
  },
  {
    "categoryId": "11-git-і-gitlab",
    "question": "Що таке GitLab",
    "answer": "GitLab - це платформа для керування репозиторіями програмного забезпечення з підтримкою системи контролю версій Git. Вона надає інструменти для спільної роботи розробників, управління проектами, автоматизації CI/CD процесів"
  },
  {
    "categoryId": "11-git-і-gitlab",
    "question": "CI/CD опис процесу",
    "answer": "CI/CD - це спосіб організації роботи над програмними проектами, щоб зробити процес розробки та випуску програм швидшим, надійнішим і зручнішим для розробників.\nCI (Continuous Integration - Постійна Інтеграція) означає, що розробники регулярно об'єднують свій код у спільний репозиторій. Це допомагає уникнути конфліктів інтеграції, коли код різних розробників несумісний. Приклад: Допустимо, у вас є команда розробників, кожен з яких працює над окремою частиною програми.\nContinuous Delivery (Постійна Доставка) Наприклад, якщо у вас є веб-сайт, після CI успішний код може автоматично готуватися для випуску, але ви вибираєте момент, коли розмістити його на сервері для відвідувачів."
  },
  {
    "categoryId": "12-chrome-developer-tools",
    "question": "Chrome Developer Tools",
    "answer": "Elements: Ця вкладка дозволяє переглядати та змінювати HTML-структуру та стилі веб-сторінки.\nConsole: Ви можете виконувати JavaScript-код і бачити його результати в реальному часі. Це корисно для тестування та відлагодження.\nSources: Ця вкладка дозволяє переходити по коду веб-сайту, встановлювати точки зупинки для відлагодження та перевіряти змінні.\nNetwork: Ви можете бачити всі мережеві запити, що виконує сторінка, це допомагає аналізувати швидкість завантаження та вирішувати проблеми.\nPerformance: Ця вкладка допомагає аналізувати продуктивність вашого веб-сайту або додатка, виявляти точки затримок та зони для оптимізації.\nMemory:: Вона надає інформацію про використання пам'яті на вашому сайті або додатку, допомагаючи знаходити витоки пам'яті та оптимізувати використання.\nApplication: Ця вкладка дозволяє переглядати та керувати файлами cookie, локальним сховищем, indexedDB та іншими даними, які ваш сайт може зберігати.\nSecurity: Вона надає інформацію про безпеку вашого сайту, включаючи SSL-сертифікати та можливі проблеми з безпекою.\nAudits (or Lighthouse ) : Цей інструмент перевіряє продуктивність, доступність, SEO та інші аспекти вашого сайту, надаючи поради щодо покращення.\nExtensions (or More Tools): Тут ви можете отримати доступ до додаткових розширень або інструментів для розробників, які можуть бути встановлені у вашому браузері."
  },
  {
    "categoryId": "12-chrome-developer-tools",
    "question": "Розгорнуті пояснення про кукі (cookies) та кеш (cache):",
    "answer": "Кукі - це невеликий фрагмент текстової інформації, який веб-сайт може зберігати на комп'ютері користувача через браузер. Кукі використовуються для збереження деякої інформації про взаємодію користувача з веб-сайтом. На віндовс знаходиться файл де зберігаються кукі в юзер → аппдата → локал → хром → дефолт → нетворк\nЯк це працює :\nТи заходиш на сайт → сервер дає cookie\nБраузер зберігає cookie\nНаступний раз браузер відправляє cookie серверу\nСервер “пам’ятає тебе”\nКукі бувають :\nСесійні - Живуть тільки під час відкриття сайту \nПриклад - Ти залогінився на сайт → сервер дав cookie → поки браузер відкритий, сайт знає, що ти залогінився.\nПостійні - Зберігаються довго (дні, тижні, місяці)\nПриклад - Ти обрав темну тему → сайт пам’ятає її наступного разу\nБезпечні - передаються тільки через HTTPS\nПриклад - Парольні сесії на банківських сайтах\nКеш - це тимчасове зберігання копій даних, яке дозволяє зменшити час завантаження вмісту при наступних запитах. Кеш використовується для збереження копій веб-сторінок, зображень, стилів, скриптів та інших ресурсів на боковому пристрої, такому як комп'ютер або смартфон. Основні аспекти кешу."
  },
  {
    "categoryId": "12-chrome-developer-tools",
    "question": "Шо таке токен сесії?",
    "answer": "Токен сесії (сесійний токен) - це унікальний ідентифікатор, який використовується для ідентифікації користувача під час його взаємодії з веб-сервером або додатком. Токен сесії зазвичай створюється сервером при вході користувача в систему і зберігається на сервері та/або в браузері користувача. Він може бути використаний для забезпечення безпеки і автентифікації користувача під час всієї сесії або певного часового проміжку.\nОсновні характеристики токенів сесії:\nУнікальність: Кожна сесія має свій власний унікальний токен, який відрізняє її від інших сесій.\nТимчасовість: Токен сесії зазвичай має обмежений термін дії. Після закінчення цього терміну користувач буде вимушений знову автентифікуватися або здійснити інші дії для продовження сесії.\nВикористання для автентифікації: Токен сесії може бути використаний для підтвердження ідентифікації користувача під час кожного запиту до сервера. Він дозволяє серверу впізнавати користувача без необхідності повторного введення імені та пароля.\nЗберігання на боці сервера і/або клієнта: Токен сесії може зберігатися на боці сервера, де він використовується для перевірки ідентифікації користувача, або на боці клієнта, як у веб-сесіях, де він зберігається в куках (cookies) або в інших місцях для зберігання стану.\nЗахист від атак: Токени сесії повинні бути добре захищені від несанкціонованого доступу. Для цього можуть використовуватися різні методи, такі як шифрування, підписи, таймери сесій тощо."
  },
  {
    "categoryId": "12-chrome-developer-tools",
    "question": "Що таке Local Storage , Sesion Storage ?",
    "answer": "Local Storage - це вбудований механізм веб-переглядачів для зберігання даних на боці клієнта, тобто на пристрої користувача. Він дозволяє веб-сайтам і веб-додаткам зберігати невеликі об'єми даних, такі як налаштування, стан сесії або інші інформаційні фрагменти, безпосередньо на пристрої користувача.\nSession Storage - це механізм веб-сховища (Web Storage) веб-переглядача, який дозволяє веб-сайтам та веб-додаткам зберігати дані на боці клієнта протягом однієї сесії. Сесія в даному випадку означає період часу відкриття веб-сайту в браузері користувача до закриття вкладки або виходу з сайту."
  },
  {
    "categoryId": "13-методології-розробки",
    "question": "Види методологій розробки ПО",
    "answer": "Waterfall - це лінійна послідовність етапів в розробці програмного забезпечення, де кожен етап має наступати після попереднього. Всі етапи плануються на початку проекту, і процес розробки відбувається послідовно.\nV-model є розширенням Waterfall і вказує на тісний зв'язок між кожним етапом розробки та його відповідним етапом тестування. Ця модель акцентує на ранньому та неперервному включенні тестування.\nSpiral - це ітеративний підхід до розробки, який поєднує елементи Waterfall та ітераційних методологій. Проект просувається через послідовні ітерації, кожна з яких має чотири основні фази: планування, аналіз ризиків, реалізація та оцінка."
  },
  {
    "categoryId": "13-методології-розробки",
    "question": "Agile",
    "answer": "Agile - це набір підходів до управління проектами та розробки програмного забезпечення, які спрямовані на гнучкість, здатність адаптуватися до змін та непередбачуваності в процесі роботи. Основною метою Agile є досягнення кращого співвідношення між змінами вимог, якості продукту та вартості розробки.\nОсновні принципи Agile:\nВзаємодія замість процесів та інструментів: Замість строгих правил і процедур акцент ставиться на комунікацію та співпрацю між розробниками, клієнтами і всіма стейкхолдерами.\nРобочий продукт замість вичерпного документування: Процес розробки зорієнтований на створення функціонуючого програмного продукту, який може бути швидко оцінений та змінений.\nСпівпраця замість переговорів замість договорів: Вимоги до проекту можуть змінюватися з часом, тому співпраця між розробниками і замовником є важливішою за жорсткі контракти.\nРеагування на зміни замість виконання плану: Agile вважає зміни невід'ємною частиною розробки. Команди повинні бути готові адаптуватися до нових умов та змінювати напрямок роботи.\nВзаємодія замість управління іншими: Розробники та інші стейкхолдери повинні працювати в тісному контакті і обмінюватися інформацією, щоб забезпечити успішну реалізацію проекту.\nScrum – опис фрейморка\nРобота ділиться на спринти тривалістю 1-3 тижні.\nПеред початком спринту команда сама формує список завдань на ітерацію.\nПід час кожного спринту створюється продукт чи послуга, які можна продемонструвати клієнту.\nПісля виконання спринту проводиться ретроспектива. Це мітинг, мета якого отримати фідбек від кожного учасника команди, виявити поточні успіхи та проблеми, тобто оцінка та аналіз виконаної роботи.\nУ скрамі є наступні зустрічі :\nДейлі стендап\nГрумінг\nПланінг\nРетроспектива\nОсновна різниця між Scrum и Канбан — в довжині ітерацій. В Scrum ітерація— 2 тижні, в Kanban задачі програмісту можна підсовувати кожний день.Якщо в Scrum мета команди - закінчити спринт, то в Kanban- Завдання.\nРолі в  Scrum : Scrum Master , Product Owner , Розробник (Development Team)"
  },
  {
    "categoryId": "13-методології-розробки",
    "question": "Артефакти Scrum",
    "answer": "Product Backlog (Список продукту)\nSprint Backlog (Список спринту)\nIncrement (Приріст продукту)\nBurndown Chart (Діаграма витрат):завдання ще залишилися виконати протягом спринту.\nRelease Burndown Chart (Діаграма витрат випуску):прогрес випуску або релізу продукту.\nDefinition of Done (Визначення готовності)\nProduct Increment (Завершений продукт)"
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Як зняти логи с Android/IOS?",
    "answer": "Для зняття логів на Android-пристроях використовують такі інструменти, як Minimal ADB, Android Studio. Для зняття логів на iOS-пристроях використовують iTunes, iMazing, XCode (для MacOS)."
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Які мобільні ОС знаєте?",
    "answer": "IOS\nAndroid\nHarmony і Microsoft"
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Який формат файлів зборок для Android и iOS?",
    "answer": "Android – SDK\nIOS – IPA"
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Типи мобільних додатків .",
    "answer": "Нативні додатки (Native apps) – мобільні додатки, написані мовами програмування, затвердженими розробниками програмного забезпечення під кожну конкретну платформу, а тому органічно вбудовуються в самі операційні системи. Додатки завантажуються через магазини програм (App Store, Google Play тощо) та відповідають вимогам цих магазинів. Нативні програми можуть повністю або частково працювати і за відсутності інтернет-з'єднання, тому користувачі менше залежать від якості зв'язку і можуть користуватися програмою там і тоді, коли їм це зручно.\nМобільні веб-додатки (Web apps) – це мобільна версія сайту лише з розширеним інтерактивом. Різниця між веб-додатком та адаптивною версткою сайту не велика, оскільки і там і там застосовуються стандартні веб-технології, а швидкість роботи обмежена якістю інтернет-з'єднання. При цьому веб-програми не розміщуються в спеціалізованих магазинах програм і зазвичай використовують браузер телефону для роботи.\nГібридні додатки (Hybrid apps) – Генератори мобільних додатків дозволяють створювати кросплатформні додатки, наближені за функціоналом та якістю до нативних додатків. Це щось середнє між нативними та веб-додатками. Такі програми встановлюються через офіційні магазини, мають обмежений доступ до апаратної частини смартфонів та планшетів, в них можна настроювати push-сповіщення. А також вони, як правило, дешевші за нативні програми.\nPWA (Progressive Web Aplication) –"
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Мережа та продуктивність",
    "answer": "a.  Умови мережі:\nПеревірка роботи додатку у різних умовах: Wi-Fi, 3G/4G/5G, слабкий сигнал, повне відключення мережі.\nПеремикання між різними типами з’єднань під час завантаження контенту.\nb.  Офлайн-режим та кешування:\nТестування функціоналу офлайн-режиму, кешування даних, синхронізації при відновленні з’єднання.\nc. Використання ресурсів:\nАналіз споживання батареї, RAM, CPU в різних сценаріях використання додатку.\nСтрес-тестування при високих навантаженнях або великих обсягах даних.\nd. Продуктивність у критичних умовах:\nТестування додатку при високій кількості одночасних запитів або дій, щоб оцінити стійкість та відгук системи."
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Установка та оновлення",
    "answer": "Перша установка:\nПеревірка установки додатку через офіційні канали (App Store, Google Play) та через прямий інсталятор (APK/IPA).\nАналіз впливу першої установки на пристрій: вільне місце, встановлення необхідних компонентів, ініціалізація кешу.\nОновлення:\nТестування оновлень з різних версій (наприклад, 1.0 → 1.2 → 2.0) з урахуванням змін у базі даних або структурі даних.\nПеревірка сценаріїв оновлення: як оновлюється додаток при включеному/вимкненому інтернеті, на різних рівнях заряду батареї та в умовах обмеженого доступу до ресурсів.\nФорс-апдейт:\nПеревірка ситуацій, коли користувач не може використовувати додаток без оновлення (forced update).\nАналіз відображення повідомлень та блокування функціоналу до завершення оновлення.\nАпдейтер:\nТестування механізму оновлення (як через магазин додатків, так і через in-app updater) — перевірка цілісності даних, сумісності нових версій з існуючими налаштуваннями.\nПереконання, що після оновлення не порушуються залежності та не залишаються артефакти попередніх версій.\nВидалення та повторна установка:\nПеревірка повного видалення додатку: очищення кешу, даних користувача, реєстрів налаштувань.\nПовторна установка після видалення – відновлення всіх необхідних даних без залишку \"сміттєвих\" файлів."
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Взаємодія з мобільним пристроєм",
    "answer": "a.  Робота з апаратними компонентами:\nТестування роботи з камерою, мікрофоном, GPS, Bluetooth.\nПеревірка інтеграції з біометрією (Face ID, Touch ID) та іншими датчиками (акселерометр, гіроскоп).\nb.  Permission-запити:\nВідпрацювання сценаріїв запитів на надання дозволів та їх зміна у налаштуваннях пристрою (надання, відкликання, обмеження доступу).\nc.  Push-нотифікації:\nТестування отримання та відображення push-сповіщень у різних сценаріях: коли додаток у фоні, на заблокованому екрані, при відключених сповіщеннях.\nd.  Фонові процеси та взаємодія з системою:\nВплив вхідних дзвінків, SMS, перемикання між додатками – перевірка, як ці дії впливають на роботу\nТестування сценаріїв при низькому заряді батареї та в умовах обмеженої оперативної пам’яті (в тому числі перевірка ситуацій, коли пам’ять на пристрої закінчується).\ne.  Інші аспекти взаємодії:\nТестування роботи додатку при різних сценаріях запуску (холодний старт, повторний запуск) та його життєвого циклу (перехід у фон, повернення у фокус)."
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "Безпека та стабільність",
    "answer": "a. Краш-репорти та логування:\nАналіз та моніторинг краш-репортів за допомогою інструментів (Firebase Crashlytics, Sentry).\nПеревірка логування помилок та їх обробки для швидкого реагування на збої.\nb. Перехоплення та аналіз API-запитів:\nВикористання інструментів (Charles Proxy, mitmproxy) для перевірки коректності API-запитів та відповіді сервера.\nc. Проблеми витоків пам’яті та роботи у фоні:\nТестування витоків пам’яті, перевірка ефективності роботи додатку у фоні, а також після повернення у фокус.\nОцінка безпеки з точки зору захисту даних, шифрування та взаємодії з системними компонентами."
  },
  {
    "categoryId": "14-особливості-тестування-нативних-додатків",
    "question": "UI/UX, адаптація під пристрої",
    "answer": "a. Дизайн та стандарти:\nВідповідність додатку стандартам Material Design (Android) або Human Interface Guidelines (iOS).\nПеревірка узгодженості стилів, кольорів, шрифтів та анімацій.\nb. Жести та інтерактивність:\nТестування жестів: свайпи, довге натискання, мультитач, pinch-to-zoom.\nПеревірка адаптивності UI під різні розміри екранів, вирізи (notch, punch-hole) та роздільну здатність.\nc. Accessibility та локалізація:\nПеревірка доступності для користувачів з особливими потребами (читабельність, масштабування тексту, голосові підказки).\nТестування локалізації та інтернаціоналізації – правильне відображення форматів дати, валюти, перекладів."
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Фази STLC",
    "answer": "Аналіз продукту\nРобота з вимогами\nРозробка тест плану\nСтворення тестової документації\nТестування\nЗвіт результатів тестування (test report)\nСтабілізація\nЕксплуатація"
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Що таке SDLC",
    "answer": "Період часу, який починається з моменту прийняття рішення про необхідність створення програмного продукту і закінчується в момент його повного вилучення з експлуатації.\nІдея (Idea)\nЗбір та аналіз вимог (Planning and Requirement Analysis)\nДокументування вимог (Defining Requirements)\nДизайн (Design Architecture)\nРозробка (Developing)\nТестування (Testing)\nВпровадження/розгортання (Deployment)\nПідтримка (Maintenance)\nСмерть (Death)"
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Test Implementation and Execution",
    "answer": "Реалізація та виконання тестування - це етап тестування програмного забезпечення, в ході якого тестові сценарії та кейси, створені на попередньому етапі, фактично виконуються з метою виявлення помилок та перевірки відповідності програмного продукту вимогам. Основна мета цього етапу - провести тестування на основі створених тестових планів і матеріалів.\nВиконання тестових скриптів та кейсів: Здійснення реалізації попередньо створених тестових сценаріїв і кейсів. Це може включати ручне виконання тестів або автоматизоване тестування на основі попередньо підготовлених скриптів.\nЗбір результатів тестування: Реєстрація результатів виконання кожного тестового сценарію чи кейсу, включаючи виявлені дефекти, відповідність вимогам та інші важливі показники.\nРеєстрація дефектів: В разі виявлення дефектів або несправностей під час виконання тестів, тестери реєструють ці проблеми в системі управління дефектами для подальшого аналізу та виправлення.\nВалідація та ретестування: Після виправлення дефектів проводиться валідація, яка перевіряє, чи були дефекти виправлені належним чином. Також може бути виконане ретестування, щоб перевірити, чи не виникли нові проблеми після виправлень.\nТестування взаємодії: Перевірка взаємодії між різними компонентами програмного продукту, такими як модулі, інтерфейси тощо."
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Test Planning and Control",
    "answer": "Планування та управління тестуванням- це перший і один з ключових етапів у процесі тестування програмного забезпечення, де визначаються стратегії, плани та ресурси для проведення ефективного тестування. Основна мета цього етапу - створення плану тестування та контроль за виконанням цього плану.\nВизначення цілей та обсягу тестування: Визначення цілей (Objective Definition): Визначення основних мети і завдань тестування, включаючи визначення важливих аспектів, що підлягатимуть перевірці. Визначення обсягу (Scope Definition): Визначення частин програмного продукту, які підлягатимуть тестуванню.\nСтворення плану тестування: Створення плану (Test Plan Creation): Розроблення докладного плану тестування, включаючи опис стратегій, методів, ресурсів, розкладу та критеріїв завершення.\nУправління ресурсами: Визначення ресурсів (Resource Definition): Визначення необхідних людських, фізичних та технічних ресурсів для виконання тестування. Управління ресурсами (Resource Management): Забезпечення належного розподілу ресурсів та використання їх відповідно до плану.\nВизначення підходів до тестування: Визначення методів та технік (Method and Technique Definition): Визначення конкретних методів та технік тестування, які будуть використовуватися під час виконання\nУправління ризиками:  Аналіз ризиків (Risk Analysis): Виявлення та оцінка можливих ризиків, які можуть вплинути на процес тестування та якість продукту. Управління ризиками (Risk Management): Визначення планів та заходів для управління виявленими ризиками.\nПланування розкладу тестування: Розклад тестування (Test Schedule): Визначення послідовності та тривалості виконання різних етапів тестування.\nКонтроль за виконанням плану: Моніторинг та звітність (Monitoring and Reporting): Відстеження ходу виконання плану, створення звітів про виконану роботу, успішність та виявлені проблеми.\nКоригування плану: Аналіз та корекція (Analysis and Adjustment): Аналіз результатів тестування та коригування плану, якщо виявляються зміни у вимогах, ресурсах чи ризиках."
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Процес контролю якості QC",
    "answer": "Планування контролю: На цьому етапі визначаються обсяги, методи та критерії\nВиконання контролю: Здійснюються дії з перевірки якості продукту або послуги відповідно до\nВиявлення дефектів: Здійснюються дії для виявлення дефектів\nАналіз та оцінка результатів: Виявлені дефекти або проблеми аналізуються\nКорекція та виправлення\nПідтвердження якості: Після виправлень і корекцій проводиться повторна перевірка,\nЗвітність: Після завершення контролю якості генерується звіт"
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Test Closure Activities",
    "answer": "Дії по завершенню тестуванн) - це етап завершення тестового процесу, який включає в себе ряд дій для оцінки та заключного аналізу результатів тестування, створення остаточних звітів та підготовки до завершення всього процесу тестування.\nОцінка критеріїв завершення тестування:Перевірка виконання критеріїв (Exit Criteria Verification): Визначення, чи були виконані усі вимоги та критерії завершення, встановлені на етапі планування та аналізу тестування.\nЗавершення тестових активностей: Завершення тестування (Testing Completion): Зупинка виконання тестових сценаріїв та активностей, пов'язаних з тестуванням.\nАналіз результатів тестування: Аналіз результатів (Results Analysis): Оцінка отриманих під час тестування даних, виявлення тенденцій, частоти дефектів та інших ключових метрик.\nЗавершення дефектів: Завершення дефектів (Defect Closure): Перевірка та закриття дефектів, які були виявлені під час тестування, після їх виправлення та підтвердження валідності.\nПідготовка фінального звіту: Створення звіту (Report Creation): Підготовка остаточного звіту про результати тестування, включаючи оцінку відповідності вимогам, кількість та статус дефектів, покриття тестування та рекомендації.\nОцінка та узагальнення: Оцінка процесу (Process Evaluation): Аналіз ефективності всього тестового\nВивчення уроків та вдосконалення:  Уроки та рекомендації (Lessons Learned): Визначення уроків, які можна взяти з тестування та рекомендацій для покращення процесу тестування у майбутньому.\nЗавершення тестового процесу: Завершення (Closure): завершення тестування, подання звіту та докс"
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Evaluation Exit Criteria and Reporting",
    "answer": "Evaluation Exit Criteria and Reporting -  означає критерії завершення оцінки та процес створення звіту під час виконання тестування програмного продукту. Це включає визначення умов, які повинні бути виконані перед завершенням етапу тестування, а також підготовку докладного звіту з результатами тестування, який включає в себе інформацію про виявлені дефекти, відповідність вимогам та інші ключові метри.\nОцінка критеріїв завершення (Exit Criteria):\nКритерії виконання (Criteria Met): Перевірка, чи були виконані всі визначені критерії завершення для цього етапу тестування.\nПокриття тестами (Test Coverage): Визначення покриття тестування тими функціями, які були перевірені, ідентифікація пропущених частин.\nУспішність (Pass Rate): Встановлення відсотку успішно виконаних тестів порівняно з загальною кількістю тестів.\nОцінка ризиків (Risk Evaluation):\nАналіз ризиків (Risk Analysis): Визначення можливих ризиків, пов'язаних зі станом продукту після тестування, і оцінка їх важливості.\nРизики після випуску (Release Risks): Визначення можливих ризиків, які можуть виникнути після випуску продукту та його вплив на бізнес.\nСтворення звіту (Reporting):\nЗвітність (Reporting): Створення докладного звіту про результати тестування, включаючи виявлені дефекти, успішність, невдачі, покриття тестування та відповідність вимогам.\nДефекти (Defects): Детальний перелік виявлених дефектів, включаючи їх статус, важливість, пріоритет і коментарі.\nРекомендації (Recommendations): Висновки та рекомендації стосовно готовності продукту, подальших дій та можливих поліпшень.\nВідомості для прийняття рішення (Decision-Making Information):\nРішення (Decision): Підтримка прийняття рішення щодо того, чи продукт готовий до переходу до наступних етапів розробки або до випуску.\nАналіз вартості та користі (Cost-Benefit Analysis): Визначення економічної вигоди і вартості подальших дій на основі результатів тестування.\nЗбереження інформації (Information Retention):\nЗбереження (Retention): Збереження всіх даних, звітів та результатів тестування для подальшого аналізу та використання при необхідності."
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Як співвідноситься життєвий цикл розробки з циклом тестування?",
    "answer": "Аналіз і вимоги: На цьому етапі визначаються вимоги до програми. Тестувальники можуть активно взяти участь у цьому етапі, сприяючи уточненню вимог щодо функцій, які повинні бути протестовані.\nПроектування: Під час цього етапу розробники створюють архітектуру та дизайн програми. Тестувальники можуть планувати тестові випробування на основі архітектури і функціональних вимог.\nРеалізація (кодування): Розробники реалізовують програму на цьому етапі. Тестувальники можуть почати створювати тестові сценарії і набори тестів, щоб перевірити окремі функції та модулі, які вже готові.\nТестування і відлагодження: На цьому етапі програма піддається інтенсивному тестуванню. Це включає функціональне тестування, тестування зовнішнього вигляду, тестування продуктивності і інше. Тестувальники реєструють помилки та проблеми і повертають їх розробникам для виправлення.\nВипуск і впровадження: Після успішного завершення тестування програму готують до випуску. Тестувальники можуть провести останню перевірку перед випуском, щоб переконатися, що всі вимоги були виконані і всі помилки виправлені.\nПідтримка та обслуговування: Після випуску програми тестувальники можуть продовжувати відслідковувати її роботу в реальному середовищі, виявляючи і виправляючи помилки, які можуть з'явитися після впровадження."
  },
  {
    "categoryId": "15-фази-тестування",
    "question": "Test Analysis and Design (Аналіз та проектування тестування)",
    "answer": "Аналіз та проектування тестування - це етап тестування програмного забезпечення, в якому визначаються вимоги до тестування, створюються тестові сценарії, тестові дані та інші аспекти, необхідні для виконання ефективних тестів. Основна мета цього етапу - створення плану тестування та підготовка необхідних матеріалів для його виконання. Ось, що входить в \"Test Analysis and Design\":\nАналіз вимог: Аналіз вимог (Requirements Analysis): Детальне вивчення вимог до програмного продукту для визначення функціональних та нефункціональних аспектів, які підлягатимуть тестуванню.\nСтворення тестових сценаріїв та кейсів: Проектування тестових сценаріїв (Test Scenario Design): Створення загальних планів для проведення тестів, визначення послідовності дій та очікуваних результатів.  Визначення тестових кейсів (Test Case Definition): Детальний розбір тестових сценаріїв на окремі тестові кейси, визначення кроків тестування та очікуваних результатів.\nСтворення тестових даних: Створення тестових даних (Test Data Creation): Підготовка вхідних даних та створення умов для виконання тестових сценаріїв.\nВизначення тестових вимог:  Встановлення тестових вимог (Test Requirements Specification): Визначення критеріїв успішності для кожного тесту, встановлення очікуваних результатів та поведінки програмного продукту під час тестування.\nВибір тестового середовища та інструментів: Визначення тестового середовища (Test Environment Definition): Визначення апаратних та програмних компонентів, налаштувань і умов, в яких будуть виконуватися тести. Вибір тестових інструментів (Test Tool Selection): Визначення інструментів, які будуть використовуватися для автоматизації, генерації тестових даних тощо.\nСтворення тестових документів: Створення плану тестування (Test Plan Creation): Розроблення детального плану тестування, включаючи стратегії, ресурси, розклад та ризики. Створення специфікацій тестування (Test Specification): Документація, яка описує деталі тестових сценаріїв, кейсів та інших аспектів тестування.\nВизначення стратегії тестування: Визначення стратегії (Test Strategy Definition): Встановлення загального підходу до тестування, включаючи методології, підходи, техніки та ресурси.\nУправління ризиками: Аналіз ризиків (Risk Analysis): Виявлення та оцінка можливих ризиків та визначення планів для їх управління під час тестування.\nЗвітність та аналіз результатів: Створення звіту про результати виконання тестів, включаючи виявлені дефекти, успішність, невдачі та рекомендації для подальших дій.\nУправління ризиками: Виявлення та аналіз ризиків під час виконання тестів, визначення заходів для їх"
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Що робить компанія якщо завтра якась важна подія в спорті?",
    "answer": "Робиться код фріз на період таких подій щоб не зіпсувати стабільність платформи на такі події"
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Потрапляєш в стару команду де немає документації, твої дії?",
    "answer": "Невідомість стану тестування: Відсутність тестової документації може призвести до невідомості щодо стану тестування. Це означає, що тестувальник і команда розробки можуть не знати, які функції були протестовані, які тести вже пройшли і які ще залишилися. Це може призвести до недооцінки обсягу робіт та незгоди щодо завершеності тестування.\nПовторна робота: Відсутність тестової документації може призвести до повторної роботи. Тестувальники можуть проводити тестування, яке вже було виконано раніше, через відсутність знань …\nНеефективність тестування: Без тестової документації важко спланувати і провести тестування систематично та методично. Це може призвести до недооцінки покриття тестування, пропуску критичних сценаріїв та помилок.\nСпроблеми з налагодженням співпраці: Тестувальники можуть мати складнощі в спілкуванні з іншими членами команди, такими як розробники та менеджери проекту, без належної документації. Вони можуть не мати чіткого зображення того, що треба перевірити, і які очікувані результати."
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Шо робити якщо завтра реліз, а регрес не провівся, твої дії?",
    "answer": "Попросити когось з команди своєї допомогти , або якщо є інші команди то їх допомогти.\nТестити спочатку лише основний функціонал продукту\nПотім затестити тест кейси високого пріоритету\nПотім затестити ті зони які змінювались під час розробки"
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Які мінуси повної автоматизації?",
    "answer": "тестувальники можуть вирішити перевірити області або виконати тести, які не враховані та не автоматизовані, і таким чином збільшити тестове покриття та знайти помилки, які б не знайшов інструмент;\nтестувальники бачать дефекти, які не були передбачені в автоматизованих тестах. Все передбачити неможливо - інженери з тестування можуть імпровізувати, а інструменти такого не роблять;\nінструменти не мають почуттів, які мають кінцеві користувачі, тому вони не можуть розраховувати на попередній досвід та інтуїцію. Тільки люди можуть повністю оцінити програму, а інструмент лише визначає, чи проходить програма тести."
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Що робити якщо джун пропускає багато багів на проді?",
    "answer": "Джуна ми не допускаємо на прод , поки не пройде онбордінг."
  },
  {
    "categoryId": "16-ситуїтивні-запитання",
    "question": "Як пріоритезувати в якому порядку має робитись задача?",
    "answer": "Питаємо у ПМ шо критично для бізнеса."
  }
];
